[{
		"name": "Halfling",
		"ability_score": "DEX +2",
		"age": "A halfling reaches adulthood at the age of 20 and generally lives into the\nmiddle of his or her second century.",
		"alignment": "Most halflings are lawful good. As a rule, they are good-hearted and kind,\nhate to see others in pain, and haven o tolerance for oppression. They are\nalso very orderly and traditional, leaning heavily on the support of their\ncommunity and the comfort of their old ways.",
		"size": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is\nSmall.",
		"speed": "25 ft.",
		"languages": [
			"Common", "Halfling"
		],
		"traits": [{
				"name": "Lucky",
				"description": "When you roll a 1 on an attack roll, ability check, or saving throw, you can\nreroll the die and must use the new roll."
			},
			{
				"name": "Brave",
				"description": "You have advantage on saving throws against being frightened."
			},
			{
				"name": "Halfling Nimbleness",
				"description": "You can move through the space of any creature that is of a size larger than\nyours."
			}
		],
		"subraces": [{
				"name": "Lightfoot",
				"ability_score": "CHA +1.",
				"traits": [{
					"name": "Naturally Stealthy",
					"description": "You can attempt to hide even when you are obscured only by a creature that is\nat least one size larger than you."
				}]
			},
			{
				"name": "Stout",
				"ability_score": "CON +1",
				"traits": [{
					"name": "Stout Resilience",
					"description": "You have advantage on saving\nthrows against poison,\nand you have resistance\nagainst poison damage."
				}]
			}
		]
	},
	{
		"name": "Half-Elf",
		"ability_score": "CHA +2, Two of Your Choice +1",
		"age": "Half-elves mature at the same rate humans do and reach adulthood around the\nage of 20. They live much longer than humans, however, often exceeding 180\nyears.",
		"alignment": "Half-elves share the chaotic bent of their elven heritage. They value both\npersonal freedom and creative expression, demonstrating neither love of\nleaders nor desire for followers. They chafe at rules, resent others’ demands,\nand sometimes prove unreliable, or at least unpredictable.",
		"size": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall.\nYour size is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "Elvish", "One of Your Choice"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Thanks to your elf blood, you have superior vision in dark and dim conditions.\nYou can see in dim light within 60 feet of you as if it were bright light, and\nin darkness as if it were dim light. You can’t discern color in darkness, only\nshades of gray."
			},
			{
				"name": "Fey Ancestry",
				"description": "You have advantage on saving throws against being charmed, and magic can’t put\nyou to sleep."
			},
			{
				"name": "Skill Versatility",
				"description": "You gain proficiency in two skills of your choice."
			}
		],
		"subraces": []
	},
	{
		"name": "Half-Orc",
		"ability_score": "STR +2, CON +1",
		"age": "Half-orcs mature a little faster than humans, reaching adulthood around age\n14. They age noticeably faster and rarely live longer than 75 years.",
		"alignment": "Half-orcs inherit a tendency toward chaos from their orc parents and are not\nstrongly inclined toward good. Half-orcs raised among ores and willing to live\nout their lives among them are usually evil.",
		"size": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5\nto well over 6 feet tall. Your size is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "Orc"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Thanks to your or c blood, you have superior vision in dark and dim\nconditions. You can see in dim light within 60 feet of you as if it were\nbright light, and in darkness as if it were dim light. You can’t discern color\nin darkness, only shades of gray."
			},
			{
				"name": "Menacing",
				"description": "You gain proficiency in the Intimidation skill."
			},
			{
				"name": "Relentless Endurance",
				"description": "When you are reduced to 0 hit points but not killed outright, you can drop to\n1 hit point instead. You can’t use this feature again until you finish along\nrest."
			},
			{
				"name": "Savage Attacks",
				"description": "When you score a critical hit with am elee weapon attack, you can roll one of\nthe weapon ’s damage dice one additional time and add it to the extra damage\nof the critical hit."
			}
		],
		"subraces": []
	},
	{
		"name": "Dragonborn",
		"ability_score": "STR +2, CHA +1",
		"age": "Young dragonborn grow quickly. They walk hours after hatching, attain the size\nand development of a 10-year-old human child by the age of 3, and reach\nadulthood by 15. They live to be around 80.",
		"alignment": "Dragonborn tend to extremes, making a conscious choice for one side or the\nother in the cosmic war between good and evil (represented by Bahamut and\nTiamat, respectively). Most dragonborn are good, but those who side with\nTiamat can be terrible villains.",
		"size": "Dragon born are taller and heavier than humans, standing well over 6 feet tall\nand averaging almost 250 pounds. Your size is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "Draconic"
		],
		"traits": [{
				"name": "Draconic Ancestry",
				"description": "<p>You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.<\/p><table border=\"1\" class=\"docutils\"><colgroup><col width=\"21%\"\/><col width=\"27%\"\/><col width=\"52%\"\/><\/colgroup><thead valign=\"bottom\"><tr class=\"row-odd\"><th class=\"head\">Dragon<\/th><th class=\"head\">Damage Type<\/th><th class=\"head\">Breath Weapon<\/th><\/tr><\/thead><tbody valign=\"top\"><tr class=\"row-even\"><td>Black<\/td><td>Acid<\/td><td>5 by 30 ft. line (Dex save)<\/td><\/tr><tr class=\"row-odd\"><td>Blue<\/td><td>Lightning<\/td><td>5 by 30 ft. line (Dex save)<\/td><\/tr><tr class=\"row-even\"><td>Brass<\/td><td>Fire<\/td><td>5 by 30 ft. line (Dex save)<\/td><\/tr><tr class=\"row-odd\"><td>Bronze<\/td><td>Lightning<\/td><td>5 by 30 ft. line (Dex save)<\/td><\/tr><tr class=\"row-even\"><td>Copper<\/td><td>Acid<\/td><td>5 by 30 ft. line (Dex save)<\/td><\/tr><tr class=\"row-odd\"><td>Gold<\/td><td>Fire<\/td><td>15 ft. cone (Dex save)<\/td><\/tr><tr class=\"row-even\"><td>Green<\/td><td>Poison<\/td><td>15 ft. cone (Con save)<\/td><\/tr><tr class=\"row-odd\"><td>Red<\/td><td>Fire<\/td><td>15 ft. cone (Dex save)<\/td><\/tr><tr class=\"row-even\"><td>Silver<\/td><td>Cold<\/td><td>15 ft. cone (Con save)<\/td><\/tr><tr class=\"row-odd\"><td>White<\/td><td>Cold<\/td><td>15 ft. cone (Con save)<\/td><\/tr><\/tbody><\/table>"
			},
			{
				"name": "Breath Weapon",
				"description": "You can use your action to exhale destructive energy. Your draconic ancestry\ndetermines the size, shape, and damage type of the exhalation. When you use\nyour breath weapon, each creature in the area of the exhalation must make a\nsaving throw, the type of which is determined by your draconic ancestry. The\nDC for this saving throw equals 8 + your Constitution modifier + your\nproficiency bonus. A creature takes 2d6 damage on a failed save, and half as\nmuch damage on a successful one. The damage increases to 3d6 at 6th level, 4\nd6 at 11th level, and 5d6 at 16th level."
			},
			{
				"name": "Damage Resistance",
				"description": "You have resistance to the damage type associated with your draconic ancestry."
			}
		],
		"subraces": []
	},
	{
		"name": "Tiefling",
		"ability_score": "INT +1, CHA +2",
		"age": "Tieflings mature at the same rate as humans but live a few years longer.",
		"alignment": "Tieflings might not have an innate tendency toward evil, but many of them end\nup there. Evil or not, an independent nature inclines many tieflings toward a\nchaotic alignment.",
		"size": "Tieflings are about the same size and build as humans. Your size is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "Infernal"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Thanks to your infernal heritage, you have superior vision in dark and dim\nconditions. You can see in dim light within 60 feet of you as if it were\nbright light, and in darkness as if it were dim light. You can’t discern color\nin darkness, only shades of gray. Hellish Resistance. You have resistance to\nfire damage."
			},
			{
				"name": "Infernal Legacy",
				"description": "You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the\nhellish rebuke spell once per day as a 2nd-level spell. Once you reach 5th\nlevel, you can also cast the darkness spell once per day. Charisma is your\nspellcasting ability for these spells."
			}
		],
		"subraces": []
	},
	{
		"name": "Gnome",
		"ability_score": "INT +2",
		"age": "Gnomes mature at the same rate humans do, and most are expected to settle down\ninto an adult life by around age 40. They can live 350 to almost 500 years.",
		"alignment": "Gnomes are most often good. Those who tend toward law are sages, engineers,\nresearchers, scholars, investigators, or inventors. Those who tend toward\nchaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are\ngood-hearted, and even the tricksters among them are more playful than\nvicious.",
		"size": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is\nSmall.",
		"speed": "25 ft.",
		"languages": [
			"Common", "Gnomish"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Accustomed to life underground, you have superior vision in dark and dim\nconditions. You can see in dim light within 60 feet of you as if it were\nbright light, and in darkness as if it were dim light. You can’t discern color\nin darkness, only shades of gray."
			},
			{
				"name": "Gnome Cunning",
				"description": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws\nagainst magic."
			}
		],
		"subraces": [{
				"name": "Forest Gnome",
				"ability_score": "DEX +1",
				"traits": [{
						"name": "Natural Illusionist",
						"description": "You know the minor illusion cantrip. Intelligence is your spellcasting ability\nfor it."
					},
					{
						"name": "Speak with Small Beasts",
						"description": "Through sound sand gestures, you can communicate simple ideas with Small or\nsmaller beasts. Forest gnomes love animals and often keep squirrels, badgers,\nrabbits, moles, woodpeckers, and other creatures as beloved pets."
					}
				]
			},
			{
				"name": "Rock Gnome",
				"ability_score": "CON +1",
				"traits": [{
						"name": "Artificer’s Lore",
						"description": "Whenever you make an Intelligence\n(History)\ncheck related to magic items, alchemical objects, or technological devices,\nyou can add twice your proficiency bonus, instead of any proficiency bonus you\nnormally apply."
					},
					{
						"name": "Tinker",
						"description": "You have proficiency with artisan’s tools\n(tinker’s tools).\nUsing those tools, you can spend 1 hour and 10 gp worth of materials to\nconstruct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function\nafter 24 hours (unless you spend 1 hour repairing it to keep the device\nfunctioning), or when you use your action to dismantle it; at that time, you\ncan reclaim the materials used to create it. You can have up to three such\ndevices active at a time. When you create a device, choose one of the\nfollowing options:"
					}
				]
			}
		]
	},
	{
		"name": "Elf",
		"ability_score": "DEX +2",
		"age": "Although elves reach physical maturity at about the same age as humans, the\nelven understanding of adulthood goes beyond physical growth to encompass\nworldly experience. An elf typically claims adulthood and an adult name around\nthe age of 100 and can live to be 750 years old.",
		"alignment": "Elves love freedom, variety, and selfexpression, so they lean strongly toward\nthe gentler aspects of chaos. They value and protect others’ freedom as well\nas their own, and they are more often good than not. The d row are an\nexception; their exile into the Underdark has made them vicious and dangerous.\nDrow are more often evil than not.",
		"size": "Elves range from under 5 to over 6 feet tall and have slender builds. Your\nsize is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "Elvish"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Accustomed to twilit forests and the night sky, you have superior vision in\ndark and dim conditions. You can see in dim light within 6 0 feet of you as if\nit were bright light, and in darkness as if it were dim light. You can’t\ndiscern color in darkness, only shades of gray."
			},
			{
				"name": "Keen Senses",
				"description": "You have proficiency in the Perception skill."
			},
			{
				"name": "Fey Ancestry",
				"description": "You have advantage on saving throws against being charmed, and magic can’t put\nyou to sleep."
			},
			{
				"name": "Trance",
				"description": "Elves don ’t need to sleep. Instead, they meditate deeply, remaining\nsemiconscious, for 4 hours a day. (The Common word for such meditation\nis “trance.”)\nWhile meditating, you can dream after a fashion; such dreams are actually\nmental exercises that have become reflexive through years of practice. After\nresting in this way, you gain the same benefit that a human does from 8 hours\nof sleep."
			}
		],
		"subraces": [{
				"name": "High Elf",
				"ability_score": "INT +1",
				"traits": [{
						"name": "Elf Weapon Training",
						"description": "You have proficiency with the lon gsword, shortsword, shortbow, and longbow."
					},
					{
						"name": "Cantrip",
						"description": "You know one cantrip of your choice from the wizard spell list. Intelligence\nis your spellcasting ability for it."
					},
					{
						"name": "Extra Language",
						"description": "You can speak, read, and write one extra language of your choice."
					}
				]
			},
			{
				"name": "Wood Elf",
				"ability_score": "WIS +1",
				"traits": [{
						"name": "Elf Weapon Training",
						"description": "You have proficiency with the longsword, sh ortsword, shortbow, and longbow."
					},
					{
						"name": "Fleet of Foot",
						"description": "Your base walking speed increases to 35 feet."
					},
					{
						"name": "Mask of the Wild",
						"description": "You can attempt to hide even when you are only lightly obscured by foliage,\nheavy rain, falling snow, mist, and other natural phenomena."
					}
				]
			},
			{
				"name": "Dark Elf (Drow)",
				"ability_score": "CHA +1",
				"traits": [{
						"name": "Superior Darkvision",
						"description": "Your darkvision has a radius of 120 feet."
					},
					{
						"name": "Sunlight Sensitivity",
						"description": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that\nrely on sight when you, the target of your attack, or whatever you are trying\nto perceive is indirect sunlight."
					},
					{
						"name": "Drow Magic",
						"description": "You know the dancing lights cantrip. When you reach 3rd level, you can cast\nthe faerie fire spell once per day. When you reach 5th level, you can also\ncast the darkness spell once per day. Charisma is your spellcasting ability\nfor these spells."
					},
					{
						"name": "Drow Weapon Training",
						"description": "You have proficiency with rapiers, sh ortswords, and hand crossbows."
					}
				]
			}
		]
	},
	{
		"name": "Human",
		"ability_score": "All +1",
		"age": "Humans reach adulthood in their late teens and live less than a century.",
		"alignment": "Humans tend toward no particular alignment. The best and the worst are found\namong them.",
		"size": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet\ntall. Regardless of your position in that range, your size is Medium.",
		"speed": "30 ft.",
		"languages": [
			"Common", "One of Your Choice"
		],
		"traits": [],
		"subraces": [{
			"name": "Variant Human",
			"ability_score": "Two of Your Choice +1",
			"traits": [{
					"name": "Skills",
					"description": "You gain proficiency in one skill of your choice."
				},
				{
					"name": "Feat",
					"description": "You gain one feat of your choice."
				}
			]
		}]
	},
	{
		"name": "Dwarf",
		"ability_score": "CON +2",
		"age": "Dwarves mature at the same rate as humans, but they’re considered young until\nthey reach the age of 50. On average, they live about 350 years.",
		"alignment": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered\nsociety. They tend toward good as well, with a strong sense of fair play and a\nbelief that everyone deserves to share in the benefits of a just order.",
		"size": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your\nsize is Medium.",
		"speed": "25 ft. (Not weighed down by heavy armor)",
		"languages": [
			"Common", "Dwarvish"
		],
		"traits": [{
				"name": "Darkvision",
				"description": "Accustomed to life underground, you have superior vision in dark and dim\nconditions. You can see in dim light within 60 feet of you as if it were\nbright light, and in darkness as if it were dim light. You can’t discern color\nin darkness, only shades of gray."
			},
			{
				"name": "Dwarven Resilience",
				"description": "You have advantage on saving throws against poison, and you have resistance\nagainst poison damage (explained in chapter 9)."
			},
			{
				"name": "Dwarven Combat Training",
				"description": "You have proficiency with the battleaxe, handaxe, throwing hammer, and\nwarhammer."
			},
			{
				"name": "Tool Proficiency",
				"description": "You gain proficiency with the artisan’s tools of your choice: smith’s tools,\nbrewer’s supplies, or mason’s tools."
			},
			{
				"name": "Stonecunning",
				"description": "Whenever you make an Intelligence\n(History)\ncheck related to the origin of stonework, you are considered proficient in the\nHistory skill and add double your proficiency bonus to the check, instead of\nyour normal proficiency bonus."
			}
		],
		"subraces": [{
				"name": "Hill Dwarf",
				"ability_score": "WIS +1",
				"traits": [{
					"name": "Dwarven Toughness",
					"description": "Your hit point maximum increases by 1, and it increases by 1 every time you\ngain a level."
				}]
			},
			{
				"name": "Mountain Dwarf",
				"ability_score": "STR +2",
				"traits": [{
					"name": "Dwarven Armor Training",
					"description": "You have proficiency with light and medium armor."
				}]
			}
		]
	}
]